{
  "_name_or_path": "/root/autodl-tmp/layoutlmv3_funsd/models/layoutlmv3_funsd/",
  "architectures": [
    "LayoutLMv3ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "coordinate_size": 128,
  "eos_token_id": 2,
  "finetuning_task": "ner",
  "has_relative_attention_bias": true,
  "has_spatial_attention_bias": true,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "PERSONAL_INFO",
    "1": "JOB_TITLE",
    "2": "PROFESSIONAL_SUMMARY",
    "3": "SKILL",
    "4": "CERTIFICATION",
    "5": "LANGUAGE",
    "6": "EDUCATION",
    "7": "WORK_EXPERIENCE",
    "8": "HOBBY",
    "9": "ADDITIONAL_ACTIVITY",
    "10": "VOLUNTEERING",
    "11": "PROJECT",
    "12": "OTHERS"
  },
  "initializer_range": 0.02,
  "input_size": 224,
  "intermediate_size": 3072,
  "label2id": {
    "ADDITIONAL_ACTIVITY": 9,
    "CERTIFICATION": 4,
    "EDUCATION": 6,
    "HOBBY": 8,
    "JOB_TITLE": 1,
    "LANGUAGE": 5,
    "OTHERS": 12,
    "PERSONAL_INFO": 0,
    "PROFESSIONAL_SUMMARY": 2,
    "PROJECT": 11,
    "SKILL": 3,
    "VOLUNTEERING": 10,
    "WORK_EXPERIENCE": 7
  },
  "layer_norm_eps": 1e-05,
  "max_2d_position_embeddings": 1024,
  "max_position_embeddings": 514,
  "max_rel_2d_pos": 256,
  "max_rel_pos": 128,
  "model_type": "layoutlmv3",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "patch_size": 16,
  "rel_2d_pos_bins": 64,
  "rel_pos_bins": 32,
  "second_input_size": 112,
  "shape_size": 128,
  "text_embed": true,
  "torch_dtype": "float32",
  "transformers_version": "4.46.3",
  "type_vocab_size": 1,
  "visual_embed": true,
  "vocab_size": 50265
}
