{
  "_name_or_path": "/root/autodl-tmp/LayoutXLM/layoutlmv3_finetuned1700/best/",
  "architectures": [
    "LayoutLMv3ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "coordinate_size": 128,
  "eos_token_id": 2,
  "finetuning_task": "ner",
  "has_relative_attention_bias": true,
  "has_spatial_attention_bias": true,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "PERSONAL_INFO",
    "1": "Nationality",
    "2": "gender",
    "3": "PHONE",
    "4": "EMAIL",
    "5": "BIRTHDAY",
    "6": "NATIVE_PLACE",
    "7": "REGISTERED_CITY",
    "8": "POLITICAL_STATUS",
    "9": "EDUCATION",
    "10": "WORK_EXPERIENCE",
    "11": "PROJECT_EXPERIENCE",
    "12": "SKILL",
    "13": "CERTIFICATION",
    "14": "LANGUAGE",
    "15": "SELF_EVALUATION",
    "16": "HOBBY",
    "17": "OTHER"
  },
  "initializer_range": 0.02,
  "input_size": 224,
  "intermediate_size": 3072,
  "label2id": {
    "BIRTHDAY": 5,
    "CERTIFICATION": 13,
    "EDUCATION": 9,
    "EMAIL": 4,
    "HOBBY": 16,
    "LANGUAGE": 14,
    "NATIVE_PLACE": 6,
    "Nationality": 1,
    "OTHER": 17,
    "PERSONAL_INFO": 0,
    "PHONE": 3,
    "POLITICAL_STATUS": 8,
    "PROJECT_EXPERIENCE": 11,
    "REGISTERED_CITY": 7,
    "SELF_EVALUATION": 15,
    "SKILL": 12,
    "WORK_EXPERIENCE": 10,
    "gender": 2
  },
  "layer_norm_eps": 1e-05,
  "max_2d_position_embeddings": 1024,
  "max_position_embeddings": 514,
  "max_rel_2d_pos": 256,
  "max_rel_pos": 128,
  "model_type": "layoutlmv3",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "patch_size": 16,
  "rel_2d_pos_bins": 64,
  "rel_pos_bins": 32,
  "second_input_size": 112,
  "shape_size": 128,
  "text_embed": true,
  "torch_dtype": "float32",
  "transformers_version": "4.46.3",
  "type_vocab_size": 1,
  "visual_embed": true,
  "vocab_size": 50265
}
